W7D3/music_app/app/controllers/bands_controller.rb

    def index
        @bands = Band.all
---
SELECT  "bands".* FROM "bands" ORDER BY "bands"."id" ASC LIMIT $1  [["LIMIT", 1]]

    def destroy
        @band = Band.find(params[:id])
        if @band.destroy
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]